# DHCP - Distribuer des IPs automatiquement

## Message du formateur

Le DHCP, c'est un **truc gÃ©nial**. Au lieu de taper manuellement l'IP sur chaque PC (galÃ¨re !), le serveur DHCP les distribue **automatiquement**.

Imagine : 200 PCs dans une entreprise. Sans DHCP, tu passes 1 mois Ã  tout configurer. Avec DHCP, c'est **automatique** en 5 secondes par PC.

**Important :** Si tu n'as pas encore lu les cours sur les IPs et les VLANs, va les lire d'abord.

---

## C'est quoi le DHCP ? (Analogie distributeur)

### SANS DHCP (Ã  la main)

```
ScÃ¨ne : Tu arrives au bureau avec ton nouveau PC

Toi : "Quelle IP je dois mettre ?"

Admin rÃ©seau : "Euh... attends je regarde mon fichier Excel...
                Voyons voir... 192.168.10.47 est libre.
                Prends celle-lÃ ."

Toi : "OK, je note. Et le masque ?"

Admin : "255.255.255.0"

Toi : "Et la passerelle ?"

Admin : "192.168.10.1"

Toi : "Et le DNS ?"

Admin : "8.8.8.8"

Toi : [tu tapes tout manuellement sur le PC]
      [Ã§a prend 5 minutes]

Admin : [il note dans son Excel que .47 est pris]

â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€

ProblÃ¨mes :
âŒ Long (1 PC = 5 minutes)
âŒ Risque d'erreur (faute de frappe)
âŒ Risque de doublon (2 PCs avec la mÃªme IP = crash rÃ©seau)
âŒ Fichier Excel Ã  tenir Ã  jour (cauchemar)
âŒ Si tu changes de salle, il faut tout refaire
```

### AVEC DHCP (automatique)

```
ScÃ¨ne : Tu arrives au bureau avec ton nouveau PC

Toi : [tu branches le cÃ¢ble rÃ©seau]

PC : "Bonjour rÃ©seau, j'ai besoin d'une IP !"

Serveur DHCP : "OK, tiens : 192.168.10.47
                Masque : 255.255.255.0
                Passerelle : 192.168.10.1
                DNS : 8.8.8.8
                C'est valable pendant 24 heures."

PC : "Merci !"

Toi : [tu ne fais RIEN, c'est automatique]
      [Ã§a prend 5 secondes]

â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€

Avantages :
âœ… Rapide (automatique)
âœ… Pas d'erreur (pas de faute de frappe)
âœ… Pas de doublon (le serveur gÃ¨re les IPs)
âœ… Pas de fichier Excel Ã  tenir
âœ… Tu changes de salle ? Pas de problÃ¨me, nouvelle IP auto
âœ… Tu peux gÃ©rer 1000 PCs facilement

C'EST COMME UN DISTRIBUTEUR AUTOMATIQUE D'IPS !
```

---

## Comment Ã§a marche ? (les 4 Ã©tapes DORA)

Le processus DHCP s'appelle **DORA** : Discover, Offer, Request, Acknowledgement.

### Les 4 Ã©tapes expliquÃ©es simplement

```
Ã‰tape 1 : DISCOVER (DÃ©couverte)
â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€
PC : "HÃ© ! Y'a un serveur DHCP dans le coin ?"
     [broadcast = crie sur tout le rÃ©seau]


Ã‰tape 2 : OFFER (Offre)
â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€
Serveur DHCP : "Ouais, je suis lÃ  !
                Je te propose l'IP 192.168.10.47"


Ã‰tape 3 : REQUEST (Demande)
â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€
PC : "OK, je prends cette IP !
      C'est bien pour moi ?"


Ã‰tape 4 : ACKNOWLEDGEMENT (Confirmation)
â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€
Serveur DHCP : "ValidÃ© !
                L'IP 192.168.10.47 est Ã  toi
                pendant 24 heures (bail/lease)"
```

### SchÃ©ma visuel complet

```
    PC                    Serveur DHCP
     â”‚                         â”‚
     â”‚  1. DISCOVER            â”‚
     â”‚  "Qui a une IP ?"       â”‚
     â”‚â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€>â”‚
     â”‚         (broadcast)     â”‚
     â”‚                         â”‚
     â”‚  2. OFFER               â”‚
     â”‚  "Prends 192.168.10.47" â”‚
     â”‚<â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”‚
     â”‚                         â”‚
     â”‚  3. REQUEST             â”‚
     â”‚  "OK je la prends"      â”‚
     â”‚â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€>â”‚
     â”‚                         â”‚
     â”‚  4. ACK                 â”‚
     â”‚  "ValidÃ© pour 24h"      â”‚
     â”‚<â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”‚
     â”‚                         â”‚
     âœ… PC a son IP !
        192.168.10.47
        Masque : 255.255.255.0
        Passerelle : 192.168.10.1
        DNS : 8.8.8.8
```

**Note importante :** Si plusieurs serveurs DHCP rÃ©pondent (OFFER), le PC prend gÃ©nÃ©ralement la **premiÃ¨re offre** reÃ§ue.

---

## Le bail DHCP (lease)

### C'est quoi un bail ?

Le serveur DHCP **prÃªte** une IP au PC pour une **durÃ©e limitÃ©e** (par dÃ©faut 24 heures).

```
Analogie : Location de voiture

Jour 1 : Tu loues une voiture pour 24h
         â†’ Tu as la voiture

Jour 2 (aprÃ¨s 12h) : Tu demandes Ã  prolonger
         â†’ Le loueur dit OK, encore 24h

Jour 3 : Tu rends la voiture
         â†’ Le loueur peut la louer Ã  quelqu'un d'autre

â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€

Avec DHCP :

Jour 1 : Tu reÃ§ois l'IP 192.168.10.47 pour 24h
         â†’ Tu as l'IP

Jour 2 (aprÃ¨s 12h) : Ton PC demande Ã  renouveler
         â†’ Le serveur dit OK, encore 24h

Jour 3 : Tu Ã©teins ton PC et le ranges
         â†’ L'IP retourne dans le pool (disponible)
```

### DurÃ©e du bail

```
DurÃ©e par dÃ©faut : 24 heures (86400 secondes)

Renouvellement :
- AprÃ¨s 50% du bail (12h) â†’ Le PC essaie de renouveler
- AprÃ¨s 87,5% du bail (21h) â†’ Le PC redemande avec insistance
- AprÃ¨s 100% (24h) â†’ Si pas renouvelÃ©, le PC perd l'IP

Bonne pratique :
- RÃ©seau bureau : 8 jours (les gens viennent tous les jours)
- RÃ©seau WiFi public : 1 heure (rotation rapide)
- RÃ©seau serveurs : IP fixe (pas de DHCP)
```

---

## Les informations distribuÃ©es par DHCP

Le serveur DHCP ne donne pas QUE l'IP. Il donne **toutes les infos** dont le PC a besoin.

```
â”Œâ”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”
â”‚  INFORMATIONS DHCP                          â”‚
â”œâ”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”¤
â”‚  1. IP ADDRESS (obligatoire)                â”‚
â”‚     L'adresse IP du PC                      â”‚
â”‚     Ex : 192.168.10.47                      â”‚
â”œâ”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”¤
â”‚  2. SUBNET MASK (obligatoire)               â”‚
â”‚     Le masque de sous-rÃ©seau                â”‚
â”‚     Ex : 255.255.255.0                      â”‚
â”œâ”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”¤
â”‚  3. DEFAULT GATEWAY (passerelle)            â”‚
â”‚     L'IP du routeur pour sortir du rÃ©seau   â”‚
â”‚     Ex : 192.168.10.1                       â”‚
â”œâ”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”¤
â”‚  4. DNS SERVER (serveur de noms)            â”‚
â”‚     Pour convertir google.com â†’ IP          â”‚
â”‚     Ex : 8.8.8.8 (Google DNS)               â”‚
â”œâ”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”¤
â”‚  5. LEASE TIME (durÃ©e du bail)              â”‚
â”‚     Combien de temps tu gardes l'IP         â”‚
â”‚     Ex : 86400 secondes (24h)               â”‚
â”œâ”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”¤
â”‚  Optionnel (mais utile) :                   â”‚
â”‚  - Serveur TFTP (pour les tÃ©lÃ©phones IP)    â”‚
â”‚  - NTP Server (serveur de temps)            â”‚
â”‚  - Domain Name (nom de domaine)             â”‚
â””â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”˜
```

---

## Configurer DHCP sur un routeur Cisco

### Configuration de base (Ã©tape par Ã©tape)

Imagine que tu veux distribuer des IPs dans le rÃ©seau **192.168.10.0/24**.

**Ouvrir le CLI du routeur :**

```cisco
Router> enable
Router# configure terminal
Router(config)#
```

---

**Ã‰tape 1 : CrÃ©er un pool DHCP (= rÃ©serve d'IPs)**

```cisco
Router(config)# ip dhcp pool MON_RESEAU
Router(dhcp-config)#
```

**Explication :** Je crÃ©e une "rÃ©serve" d'IPs appelÃ©e `MON_RESEAU`.
Tu peux l'appeler comme tu veux : COMPTA, VLAN10, BUREAU, etc.

---

**Ã‰tape 2 : DÃ©finir le rÃ©seau Ã  distribuer**

```cisco
Router(dhcp-config)# network 192.168.10.0 255.255.255.0
```

**Explication :** Le serveur DHCP va distribuer des IPs dans le rÃ©seau 192.168.10.0/24 (de .1 Ã  .254).

---

**Ã‰tape 3 : DÃ©finir la passerelle par dÃ©faut**

```cisco
Router(dhcp-config)# default-router 192.168.10.1
```

**Explication :** Les PCs auront comme passerelle l'IP 192.168.10.1 (souvent l'IP du routeur lui-mÃªme).

---

**Ã‰tape 4 : DÃ©finir le serveur DNS**

```cisco
Router(dhcp-config)# dns-server 8.8.8.8
```

**Explication :** Les PCs utiliseront le DNS de Google (8.8.8.8) pour rÃ©soudre les noms de domaine.

Alternatives :
- `8.8.8.8` â†’ Google DNS (fiable)
- `1.1.1.1` â†’ Cloudflare DNS (rapide)
- `192.168.10.10` â†’ Ton propre serveur DNS interne

---

**Ã‰tape 5 : DÃ©finir la durÃ©e du bail (optionnel)**

```cisco
Router(dhcp-config)# lease 7
```

**Explication :** Le bail dure 7 jours (au lieu des 24h par dÃ©faut).

---

**Ã‰tape 6 : Sortir de la config du pool**

```cisco
Router(dhcp-config)# exit
Router(config)#
```

---

**Ã‰tape 7 : Exclure les IPs rÃ©servÃ©es**

```cisco
Router(config)# ip dhcp excluded-address 192.168.10.1 192.168.10.10
```

**Explication :** Le serveur DHCP NE DOIT PAS distribuer les IPs de .1 Ã  .10.
Pourquoi ? Elles sont rÃ©servÃ©es pour :
- 192.168.10.1 â†’ Routeur (passerelle)
- 192.168.10.2 â†’ Serveur de fichiers
- 192.168.10.3 â†’ Serveur mail
- 192.168.10.10 â†’ Imprimante rÃ©seau
- etc.

---

**Ã‰tape 8 : Configurer l'interface du routeur**

```cisco
Router(config)# interface gigabitEthernet 0/0
Router(config-if)# ip address 192.168.10.1 255.255.255.0
Router(config-if)# no shutdown
Router(config-if)# exit
```

**Explication :** Le routeur doit avoir une IP dans le rÃ©seau pour pouvoir distribuer les IPs.

---

**Ã‰tape 9 : Sauvegarder**

```cisco
Router(config)# exit
Router# write memory
```

---

### Configuration complÃ¨te (Ã  copier-coller)

```cisco
! Entrer en mode configuration
Router> enable
Router# configure terminal

! CrÃ©er un pool DHCP
Router(config)# ip dhcp pool MON_RESEAU
Router(dhcp-config)# network 192.168.10.0 255.255.255.0
Router(dhcp-config)# default-router 192.168.10.1
Router(dhcp-config)# dns-server 8.8.8.8
Router(dhcp-config)# lease 7
Router(dhcp-config)# exit

! Exclure les IPs rÃ©servÃ©es (routeur, serveurs)
Router(config)# ip dhcp excluded-address 192.168.10.1 192.168.10.10

! Configurer l'interface du routeur
Router(config)# interface gigabitEthernet 0/0
Router(config-if)# ip address 192.168.10.1 255.255.255.0
Router(config-if)# no shutdown
Router(config-if)# exit

! Sauvegarder
Router(config)# exit
Router# write memory
```

---

## TP Packet Tracer - DHCP pour 3 PCs

### Objectif

Configurer un serveur DHCP sur un routeur pour distribuer automatiquement des IPs Ã  3 PCs.

Ã€ la fin, les 3 PCs auront des IPs automatiques et pourront communiquer entre eux.

---

### Topologie cible

```
 PC1    PC2    PC3
  â”‚      â”‚      â”‚
  â””â”€â”€â”€â”€â”€â”€â”´â”€â”€â”€â”€â”€â”€â”˜
         â”‚
      Switch
         â”‚
      Router
      (DHCP activÃ©)
         â”‚
   [Internet simulÃ©]
```

---

### Ã‰tape 1 : CrÃ©er la topologie

1. Ajoute **3 PCs** (PC0, PC1, PC2)
2. Ajoute **1 switch 2960**
3. Ajoute **1 routeur 1841**

4. CÃ¢ble :
   - PC0 â†’ Switch Fa0/1
   - PC1 â†’ Switch Fa0/2
   - PC2 â†’ Switch Fa0/3
   - Switch Fa0/24 â†’ Router Fa0/0

Attends que tous les cÃ¢bles soient **verts**.

---

### Ã‰tape 2 : Configurer le routeur DHCP

Clique sur le routeur â†’ CLI

```cisco
Router> enable
Router# configure terminal

! CrÃ©er le pool DHCP
Router(config)# ip dhcp pool RESEAU_BUREAU
Router(dhcp-config)# network 192.168.10.0 255.255.255.0
Router(dhcp-config)# default-router 192.168.10.1
Router(dhcp-config)# dns-server 8.8.8.8
Router(dhcp-config)# exit

! Exclure l'IP du routeur
Router(config)# ip dhcp excluded-address 192.168.10.1

! Configurer l'interface du routeur
Router(config)# interface fastEthernet 0/0
Router(config-if)# ip address 192.168.10.1 255.255.255.0
Router(config-if)# no shutdown
Router(config-if)# exit

Router(config)# exit
Router# write memory
```

---

### Ã‰tape 3 : Configurer les PCs en DHCP

**Pour PC0 :**

1. Clique sur **PC0**
2. Va dans **Desktop**
3. Clique sur **IP Configuration**
4. Coche **DHCP** (au lieu de Static)
5. Attends quelques secondes...

**RÃ©sultat attendu :**

```
DHCP request successful

IP Address: 192.168.10.2
Subnet Mask: 255.255.255.0
Default Gateway: 192.168.10.1
DNS Server: 8.8.8.8
```

**BRAVO ! Le PC a reÃ§u son IP automatiquement !**

---

**RÃ©pÃ¨te pour PC1 et PC2 :**

- PC1 : Coche DHCP
  - RÃ©sultat : 192.168.10.3 (ou une autre IP disponible)

- PC2 : Coche DHCP
  - RÃ©sultat : 192.168.10.4 (ou une autre IP disponible)

---

### Ã‰tape 4 : VÃ©rifier les IPs distribuÃ©es

**Sur le routeur, tape cette commande :**

```cisco
Router# show ip dhcp binding
```

**RÃ©sultat attendu :**

```
IP address       Client-ID/              Lease expiration        Type
                 Hardware address
192.168.10.2     0001.9652.5D42          Mar 02 2024 12:00 PM    Automatic
192.168.10.3     0001.4325.AB12          Mar 02 2024 12:01 PM    Automatic
192.168.10.4     0001.8765.CD34          Mar 02 2024 12:02 PM    Automatic
```

**Analyse :**
- 3 IPs ont Ã©tÃ© distribuÃ©es âœ…
- Chaque IP a une adresse MAC associÃ©e
- Chaque IP a une date d'expiration (lease)

---

### Ã‰tape 5 : Tester la communication

**Test 1 : PC0 ping PC1**

1. Clique sur **PC0**
2. Desktop â†’ Command Prompt
3. Tape : `ipconfig`
4. Note l'IP de PC0 (ex: 192.168.10.2)
5. Tape : `ping 192.168.10.3` (IP de PC1)
6. **RÃ©sultat attendu : Reply from... âœ…**

**Test 2 : PC0 ping la passerelle (routeur)**

```
ping 192.168.10.1
```

**RÃ©sultat attendu : Reply from... âœ…**

**Test 3 : PC0 ping DNS**

```
ping 8.8.8.8
```

**RÃ©sultat attendu : Reply from... âœ…** (si Internet est configurÃ©)

---

### Ã‰tape 6 : Renouveler le bail DHCP

Tu peux simuler le renouvellement du bail.

**Sur PC0 :**

1. Desktop â†’ Command Prompt
2. Tape : `ipconfig /release` (libÃ¨re l'IP)
3. Tape : `ipconfig` (tu n'as plus d'IP)
4. Tape : `ipconfig /renew` (redemande une IP)
5. **Le PC reÃ§oit une nouvelle IP (ou la mÃªme)**

---

## Configuration DHCP avec VLANs (avancÃ©)

Si tu as plusieurs VLANs, tu dois crÃ©er **un pool DHCP par VLAN**.

### Exemple : 3 VLANs

```
VLAN 10 : Compta (192.168.10.0/24)
VLAN 20 : RH (192.168.20.0/24)
VLAN 30 : Direction (192.168.30.0/24)
```

### Configuration routeur

```cisco
Router> enable
Router# configure terminal

! â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•
! Pool DHCP pour VLAN 10 (Compta)
! â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•
Router(config)# ip dhcp pool VLAN10_COMPTA
Router(dhcp-config)# network 192.168.10.0 255.255.255.0
Router(dhcp-config)# default-router 192.168.10.1
Router(dhcp-config)# dns-server 8.8.8.8
Router(dhcp-config)# exit

Router(config)# ip dhcp excluded-address 192.168.10.1 192.168.10.10

! â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•
! Pool DHCP pour VLAN 20 (RH)
! â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•
Router(config)# ip dhcp pool VLAN20_RH
Router(dhcp-config)# network 192.168.20.0 255.255.255.0
Router(dhcp-config)# default-router 192.168.20.1
Router(dhcp-config)# dns-server 8.8.8.8
Router(dhcp-config)# exit

Router(config)# ip dhcp excluded-address 192.168.20.1 192.168.20.10

! â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•
! Pool DHCP pour VLAN 30 (Direction)
! â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•
Router(config)# ip dhcp pool VLAN30_DIRECTION
Router(dhcp-config)# network 192.168.30.0 255.255.255.0
Router(dhcp-config)# default-router 192.168.30.1
Router(dhcp-config)# dns-server 8.8.8.8
Router(dhcp-config)# exit

Router(config)# ip dhcp excluded-address 192.168.30.1 192.168.30.10

! â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•
! Sous-interfaces pour routing inter-VLAN
! â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•
Router(config)# interface fa0/0.10
Router(config-subif)# encapsulation dot1Q 10
Router(config-subif)# ip address 192.168.10.1 255.255.255.0
Router(config-subif)# exit

Router(config)# interface fa0/0.20
Router(config-subif)# encapsulation dot1Q 20
Router(config-subif)# ip address 192.168.20.1 255.255.255.0
Router(config-subif)# exit

Router(config)# interface fa0/0.30
Router(config-subif)# encapsulation dot1Q 30
Router(config-subif)# ip address 192.168.30.1 255.255.255.0
Router(config-subif)# exit

Router(config)# interface fa0/0
Router(config-if)# no shutdown
Router(config-if)# exit

Router(config)# exit
Router# write memory
```

**Maintenant, chaque VLAN a son propre serveur DHCP !**

---

## Commandes de vÃ©rification DHCP

### Voir les IPs distribuÃ©es

```cisco
Router# show ip dhcp binding
```

**Affiche :**
- Les IPs attribuÃ©es
- Les adresses MAC des clients
- La date d'expiration du bail

---

### Voir les pools DHCP

```cisco
Router# show ip dhcp pool
```

**Affiche :**
- Les pools configurÃ©s
- Le rÃ©seau de chaque pool
- Le nombre d'IPs distribuÃ©es

---

### Voir les statistiques DHCP

```cisco
Router# show ip dhcp server statistics
```

**Affiche :**
- Nombre de DISCOVER reÃ§us
- Nombre d'OFFER envoyÃ©s
- Nombre de REQUEST reÃ§us
- Nombre d'ACK envoyÃ©s

---

### Effacer un bail DHCP (libÃ©rer une IP)

```cisco
Router# clear ip dhcp binding 192.168.10.2
```

**Effet :** L'IP 192.168.10.2 est libÃ©rÃ©e et retourne dans le pool.

---

## Exercices progressifs

### Exercice 1 (FACILE) - Configuration basique

Configure un serveur DHCP sur un routeur pour le rÃ©seau **192.168.50.0/24**.

**ParamÃ¨tres :**
- Pool : RESEAU_TEST
- Passerelle : 192.168.50.1
- DNS : 1.1.1.1 (Cloudflare)
- Exclure : 192.168.50.1 Ã  192.168.50.20

<details>
<summary>ğŸ“– Voir la solution</summary>

```cisco
Router> enable
Router# configure terminal

Router(config)# ip dhcp pool RESEAU_TEST
Router(dhcp-config)# network 192.168.50.0 255.255.255.0
Router(dhcp-config)# default-router 192.168.50.1
Router(dhcp-config)# dns-server 1.1.1.1
Router(dhcp-config)# exit

Router(config)# ip dhcp excluded-address 192.168.50.1 192.168.50.20

Router(config)# interface fa0/0
Router(config-if)# ip address 192.168.50.1 255.255.255.0
Router(config-if)# no shutdown
Router(config-if)# exit

Router(config)# exit
Router# write memory
```

</details>

---

### Exercice 2 (MOYEN) - TP complet avec 2 rÃ©seaux

CrÃ©e cette topologie dans Packet Tracer :

```
RÃ©seau 1 : 10.0.10.0/24 (3 PCs)
RÃ©seau 2 : 10.0.20.0/24 (2 PCs)

Routeur avec DHCP sur les 2 rÃ©seaux
```

**TÃ¢ches :**
1. CrÃ©e la topologie
2. Configure DHCP pour les 2 rÃ©seaux
3. Configure les PCs en DHCP
4. VÃ©rifie que tous les PCs ont des IPs
5. Teste les pings

<details>
<summary>ğŸ“– Voir la solution</summary>

**Configuration routeur :**

```cisco
Router> enable
Router# configure terminal

! Pool rÃ©seau 1
Router(config)# ip dhcp pool RESEAU1
Router(dhcp-config)# network 10.0.10.0 255.255.255.0
Router(dhcp-config)# default-router 10.0.10.1
Router(dhcp-config)# dns-server 8.8.8.8
Router(dhcp-config)# exit

Router(config)# ip dhcp excluded-address 10.0.10.1

! Pool rÃ©seau 2
Router(config)# ip dhcp pool RESEAU2
Router(dhcp-config)# network 10.0.20.0 255.255.255.0
Router(dhcp-config)# default-router 10.0.20.1
Router(dhcp-config)# dns-server 8.8.8.8
Router(dhcp-config)# exit

Router(config)# ip dhcp excluded-address 10.0.20.1

! Interfaces
Router(config)# interface fa0/0
Router(config-if)# ip address 10.0.10.1 255.255.255.0
Router(config-if)# no shutdown
Router(config-if)# exit

Router(config)# interface fa0/1
Router(config-if)# ip address 10.0.20.1 255.255.255.0
Router(config-if)# no shutdown
Router(config-if)# exit

Router(config)# exit
Router# write memory
```

**Test :**
```
PC rÃ©seau 1 ping PC rÃ©seau 2 â†’ âœ… OK
```

</details>

---

### Exercice 3 (AVANCÃ‰) - DHCP avec VLANs

CrÃ©e un rÃ©seau complet avec :
- 1 switch configurÃ© avec 3 VLANs (10, 20, 30)
- 1 routeur avec DHCP pour chaque VLAN
- 6 PCs (2 par VLAN)

**Tous les PCs doivent avoir des IPs automatiques.**

<details>
<summary>ğŸ“– Voir la solution</summary>

Voir la section "Configuration DHCP avec VLANs" plus haut pour la config complÃ¨te.

**RÃ©sumÃ© :**
1. Configure les VLANs sur le switch
2. Configure 3 pools DHCP sur le routeur (1 par VLAN)
3. Configure les sous-interfaces sur le routeur
4. Configure le trunk entre switch et routeur
5. Configure les PCs en DHCP

**RÃ©sultat :**
- PCs VLAN 10 â†’ IPs en 192.168.10.x
- PCs VLAN 20 â†’ IPs en 192.168.20.x
- PCs VLAN 30 â†’ IPs en 192.168.30.x

</details>

---

## RÃ©capitulatif - Ce que tu as appris

âœ… **DHCP** = Distribution automatique d'IPs

âœ… **DORA** (processus) :
  - Discover (le PC cherche un serveur)
  - Offer (le serveur propose une IP)
  - Request (le PC demande l'IP)
  - Acknowledgement (le serveur valide)

âœ… **Bail DHCP** :
  - DurÃ©e : 24h par dÃ©faut
  - Renouvellement Ã  50% (12h)
  - LibÃ©ration quand le PC s'Ã©teint

âœ… **Infos distribuÃ©es** :
  - IP, masque, passerelle, DNS, durÃ©e du bail

âœ… **Configuration Cisco** :
  - `ip dhcp pool NOM`
  - `network X.X.X.X Y.Y.Y.Y`
  - `default-router X.X.X.X`
  - `dns-server X.X.X.X`
  - `ip dhcp excluded-address X.X.X.X Y.Y.Y.Y`

âœ… **VÃ©rification** :
  - `show ip dhcp binding`
  - `show ip dhcp pool`
  - `show ip dhcp server statistics`

---

## Prochaine Ã©tape

Maintenant que tu maÃ®trises les IPs, le subnetting, les VLANs et le DHCP, on va **assembler tout Ã§a** pour crÃ©er un **rÃ©seau d'entreprise complet** !

**Conseils avant de continuer :**
- Refais les exercices jusqu'Ã  ce que ce soit fluide
- EntraÃ®ne-toi Ã  configurer DHCP avec plusieurs VLANs
- Teste les commandes de vÃ©rification

**Tu es prÃªt pour le projet final ! ğŸ’ª**
